<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>(Multiselect)</key>
	<string>New Folder with Selection (%d Items)</string>
	<key>A-B Loop</key>
	<string>A-B Loop</string>
	<key>A-B Loop Active</key>
	<string>A-B Loop Active</string>
	<key>A-B Loop Cancel</key>
	<string>A-B Loop Cancel</string>
	<key>A-B Loop: A</key>
	<string>A-B Loop: A</string>
	<key>A-B Loop: A Greater than B</key>
	<string>A-B Loop: A Greater than B</string>
	<key>A-B Loop: B</key>
	<string>A-B Loop: B</string>
	<key>Actions</key>
	<string>Actions</string>
	<key>Add</key>
	<string>Add</string>
	<key>Add Current Folder</key>
	<string>Add Current Folder</string>
	<key>Add Separator</key>
	<string>Add Separator</string>
	<key>Adjust Window to Actual Image Size</key>
	<string>Adjust Window to Actual Image Size</string>
	<key>Adjust Window to Current Image Size</key>
	<string>Adjust Window to Current Image Size</string>
	<key>Advanced</key>
	<string>Advanced</string>
	<key>Alias Type</key>
	<string>Alias Type</string>
	<key>Always Generate HD Thumbnails</key>
	<string>Always Generate HD Thumbnails</string>
	<key>Always Generate Standard Thumbnails</key>
	<string>Always Generate Standard Thumbnails</string>
	<key>Apply Filter</key>
	<string>Apply Filter</string>
	<key>Apply to all</key>
	<string>Apply to all</string>
	<key>Are you sure you want to move xxx to xxx?</key>
	<string>Are you sure you want to move "%1$@" to "%2$@"?</string>
	<key>Arrow</key>
	<string>Arrow</string>
	<key>AudioMetadata-BitRate</key>
	<string>Bit Rate</string>
	<key>AudioMetadata-ChannelLayout</key>
	<string>Channel Layout</string>
	<key>AudioMetadata-Channels</key>
	<string>Channels</string>
	<key>AudioMetadata-CodecLongName</key>
	<string>Codec Long Name</string>
	<key>AudioMetadata-CodecName</key>
	<string>Codec Name</string>
	<key>AudioMetadata-Index</key>
	<string>Index</string>
	<key>AudioMetadata-Language</key>
	<string>Language</string>
	<key>AudioMetadata-SampleRate</key>
	<string>Sample Rate</string>
	<key>AudioMetadata-StreamTitle</key>
	<string>Stream Title</string>
	<key>Auto</key>
	<string>Auto</string>
	<key>Auto Play Selected Video</key>
	<string>Auto Play Selected Video</string>
	<key>Auto Play Visible Video</key>
	<string>Auto Play Visible Video</string>
	<key>Auto Rename</key>
	<string>Auto Rename</string>
	<key>Border Thickness</key>
	<string>Border Thickness</string>
	<key>Cancel</key>
	<string>Cancel</string>
	<key>Cancel Auto Play Visible Video</key>
	<string>Cancel Auto Play Visible Video</string>
	<key>Cancel Filter</key>
	<string>Cancel Filter</string>
	<key>Case Sensitive</key>
	<string>Case Sensitive</string>
	<key>Cell Padding</key>
	<string>Cell Padding</string>
	<key>Center the Window</key>
	<string>Center the Window</string>
	<key>Choose a file or folder</key>
	<string>Choose a file or folder</string>
	<key>Clear</key>
	<string>Clear</string>
	<key>Close (Double Click)</key>
	<string>Close (Double Click)</string>
	<key>Close Other Tabs</key>
	<string>Close Other Tabs</string>
	<key>Close Tab</key>
	<string>Close Tab</string>
	<key>Continue</key>
	<string>Continue</string>
	<key>Copy</key>
	<string>Copy</string>
	<key>Copy Path</key>
	<string>Copy Path</string>
	<key>Corner Radius</key>
	<string>Corner Radius</string>
	<key>Custom Layout Style</key>
	<string>Custom Layout Style</string>
	<key>Custom Layout Style...</key>
	<string>Custom Layout Style...</string>
	<key>Custom Zoom Ratio...</key>
	<string>Custom Zoom Ratio...</string>
	<key>Custom Zoom Step...</key>
	<string>Custom Zoom Step...</string>
	<key>Date Added</key>
	<string>Date Added</string>
	<key>Date Created</key>
	<string>Date Created</string>
	<key>Date Modified</key>
	<string>Date Modified</string>
	<key>Default Thumbnail Size</key>
	<string>Default Thumbnail Size</string>
	<key>Delete</key>
	<string>Delete</string>
	<key>Demo</key>
	<string>Demo</string>
	<key>Directory does not exist</key>
	<string>Directory does not exist</string>
	<key>Disable Automatic Play</key>
	<string>Disable Automatic Play</string>
	<key>Disable Automatic Scroll</key>
	<string>Disable Automatic Scroll</string>
	<key>Edit Mode</key>
	<string>Edit Mode</string>
	<key>Ellipse</key>
	<string>Ellipse</string>
	<key>Empty</key>
	<string>Empty</string>
	<key>Enable Automatic Play</key>
	<string>Enable Automatic Play</string>
	<key>Enable Automatic Scroll</key>
	<string>Enable Automatic Scroll</string>
	<key>Enable HDR</key>
	<string>Enable HDR</string>
	<key>Enable Recursive Mode</key>
	<string>Enable Recursive Mode</string>
	<key>Enlarge the Thumbnails</key>
	<string>Enlarge the Thumbnails</string>
	<key>Enter Full Screen</key>
	<string>Enter Full Screen</string>
	<key>Enter the auto play interval in seconds:</key>
	<string>Enter the auto play interval in seconds:</string>
	<key>Enter the scroll speed in pixels per second:</key>
	<string>Enter the scroll speed in pixels per second:</string>
	<key>Eraser</key>
	<string>Eraser</string>
	<key>Error</key>
	<string>Error</string>
	<key>Exif-ApertureValue</key>
	<string>Aperture Value</string>
	<key>Exif-Artist</key>
	<string>Artist</string>
	<key>Exif-CameraMaker</key>
	<string>Make</string>
	<key>Exif-CameraModel</key>
	<string>Camera Model</string>
	<key>Exif-ColorModel</key>
	<string>Color Model</string>
	<key>Exif-DateTimeDigitized</key>
	<string>Date Time Digitized</string>
	<key>Exif-DateTimeOriginal</key>
	<string>Date Time Taken</string>
	<key>Exif-Depth</key>
	<string>Depth</string>
	<key>Exif-ExposureTime</key>
	<string>Exposure Time</string>
	<key>Exif-FNumber</key>
	<string>F-Number</string>
	<key>Exif-FileAddedTime</key>
	<string>File Added Time</string>
	<key>Exif-FileCreatedTime</key>
	<string>File Created Time</string>
	<key>Exif-FileModifiedTime</key>
	<string>File Modified Time</string>
	<key>Exif-FileSize</key>
	<string>File Size</string>
	<key>Exif-Flash</key>
	<string>Flash</string>
	<key>Exif-Flash-Off</key>
	<string>Off</string>
	<key>Exif-Flash-On</key>
	<string>On</string>
	<key>Exif-FocalLength</key>
	<string>Focal Length</string>
	<key>Exif-GPSAltitude</key>
	<string>GPS Altitude</string>
	<key>Exif-GPSLatitude</key>
	<string>GPS Latitude</string>
	<key>Exif-GPSLongitude</key>
	<string>GPS Longitude</string>
	<key>Exif-ISOSpeedRatings</key>
	<string>ISO Speed Ratings</string>
	<key>Exif-LensModel</key>
	<string>Lens Model</string>
	<key>Exif-ProfileName</key>
	<string>Profile Name</string>
	<key>Exif-Rating</key>
	<string>Rating</string>
	<key>Exif-Resolution</key>
	<string>Resolution</string>
	<key>Exif-Software</key>
	<string>Software</string>
	<key>Exif-TIFFDateTime</key>
	<string>TIFF Date Time</string>
	<key>Exit Edit Mode</key>
	<string>Exit Edit Mode</string>
	<key>Exit Full Screen</key>
	<string>退出全屏</string>
	<key>Exit Recursive Mode</key>
	<string>Exit Recursive Mode</string>
	<key>Failed to set this app as the default for some file types:
</key>
	<string>Failed to set this app as the default for some file types:
</string>
	<key>Favorites</key>
	<string>Favorites</string>
	<key>File Already Exists</key>
	<string>File Already Exists</string>
	<key>File Info</key>
	<string>File Info</string>
	<key>File Path</key>
	<string>File Path</string>
	<key>Filename</key>
	<string>Filename</string>
	<key>Filename Font Size</key>
	<string>Filename Font Size</string>
	<key>Filter</key>
	<string>Filter</string>
	<key>Filter by Finder Tag</key>
	<string>Filter by Finder Tag</string>
	<key>Filter by Rating</key>
	<string>Filter by Rating</string>
	<key>Finder Alias</key>
	<string>Finder Alias</string>
	<key>Finder Tags</key>
	<string>Finder Tags</string>
	<key>Folder</key>
	<string>Folder</string>
	<key>Folders</key>
	<string>Folders</string>
	<key>Follow Current Folder</key>
	<string>Follow Current Folder</string>
	<key>General</key>
	<string>General</string>
	<key>Go Back</key>
	<string>Go Back</string>
	<key>Go Forward</key>
	<string>Go Forward</string>
	<key>Go To</key>
	<string>Go To</string>
	<key>Grid View</key>
	<string>Grid View</string>
	<key>Have Reached the First</key>
	<string>Have Reached the First</string>
	<key>Have Reached the Last</key>
	<string>Have Reached the Last</string>
	<key>Highlighter</key>
	<string>Highlighter</string>
	<key>Image</key>
	<string>Image</string>
	<key>Images</key>
	<string>Images</string>
	<key>Include Folders</key>
	<string>Include Folders</string>
	<key>Info</key>
	<string>Info</string>
	<key>Invalid current path</key>
	<string>Invalid current path</string>
	<key>Invalid input, please enter a positive number</key>
	<string>Invalid input, please enter a positive number</string>
	<key>Invalid relative path</key>
	<string>Invalid relative path</string>
	<key>Justified View</key>
	<string>Justified View</string>
	<key>Learn More...</key>
	<string>Learn More...</string>
	<key>Line Space Adjustment</key>
	<string>Line Space Adjustment</string>
	<key>Loading...</key>
	<string>Loading...</string>
	<key>Location</key>
	<string>Location</string>
	<key>Lock Mirror</key>
	<string>Lock Mirror</string>
	<key>Lock Rotation</key>
	<string>Lock Rotation</string>
	<key>Lock Zoom</key>
	<string>Lock Zoom</string>
	<key>Match All (AND)</key>
	<string>Match All (AND)</string>
	<key>Match Any (OR)</key>
	<string>Match Any (OR)</string>
	<key>Maximize Window</key>
	<string>Maximize Window</string>
	<key>Merge All Windows</key>
	<string>Merge All Windows</string>
	<key>Mirror Flip</key>
	<string>Mirror Flip</string>
	<key>More</key>
	<string>More</string>
	<key>Move Down</key>
	<string>Move Down</string>
	<key>Move Here</key>
	<string>Move Here</string>
	<key>Move Items</key>
	<string>Move Items</string>
	<key>Move Up</key>
	<string>Move Up</string>
	<key>Move to Trash</key>
	<string>Move to Trash</string>
	<key>Name</key>
	<string>Name</string>
	<key>New</key>
	<string>New</string>
	<key>New Folder</key>
	<string>New Folder</string>
	<key>New Tab</key>
	<string>New Tab</string>
	<key>New Tag</key>
	<string>New Tag</string>
	<key>New Text File</key>
	<string>New Text File</string>
	<key>New name for</key>
	<string>New name for</string>
	<key>No Color</key>
	<string>No Color</string>
	<key>No Rating</key>
	<string>No Rating</string>
	<key>Non-Grid View</key>
	<string>Non-Grid View</string>
	<key>Not Include Folders</key>
	<string>Not Include Folders</string>
	<key>Not Show All Types of Files</key>
	<string>Not Show All Types of Files</string>
	<key>Not Show Hidden Files</key>
	<string>Not Show Hidden Files</string>
	<key>OK</key>
	<string>OK</string>
	<key>Only images can be edited</key>
	<string>Only images can be edited</string>
	<key>Open</key>
	<string>Open</string>
	<key>Open With</key>
	<string>Open With</string>
	<key>Open in Finder</key>
	<string>Open in Finder</string>
	<key>Open in Map</key>
	<string>Open in Map</string>
	<key>Open in New Tab</key>
	<string>Open in New Tab</string>
	<key>Open in Terminal</key>
	<string>Open in Terminal</string>
	<key>Open with External Player</key>
	<string>Open with External Player</string>
	<key>Operation Logs</key>
	<string>Operation Logs</string>
	<key>Original Path</key>
	<string>Original Path</string>
	<key>Other</key>
	<string>Other</string>
	<key>Others</key>
	<string>Others</string>
	<key>Paste</key>
	<string>Paste</string>
	<key>Path does not exist</key>
	<string>Path does not exist</string>
	<key>Pen</key>
	<string>Pen</string>
	<key>Pin Window</key>
	<string>Pin Window</string>
	<key>Pin Window to Top</key>
	<string>Pin Window to Top</string>
	<key>Please select a specific tag</key>
	<string>Please select a specific tag</string>
	<key>Portable Browsing Mode</key>
	<string>Portable Browsing Mode</string>
	<key>Portable Mode: Off</key>
	<string>Portable Mode: Off</string>
	<key>Portable Mode: On</key>
	<string>Portable Mode: On</string>
	<key>Prefer Using Embedded Thumbnails</key>
	<string>Prefer Using Embedded Thumbnails</string>
	<key>Quick Search</key>
	<string>Quick Search</string>
	<key>RAW Uses Exif Embedded Thumbnail</key>
	<string>RAW Uses Exif Embedded Thumbnail</string>
	<key>Rating</key>
	<string>Rating</string>
	<key>Readme...</key>
	<string>Readme...</string>
	<key>Rectangle</key>
	<string>Rectangle</string>
	<key>Recursive Mode</key>
	<string>Recursive Mode</string>
	<key>Redo</key>
	<string>Redo</string>
	<key>Reduce the Thumbnails</key>
	<string>Reduce the Thumbnails</string>
	<key>Refresh</key>
	<string>Refresh</string>
	<key>Regex</key>
	<string>Regex</string>
	<key>Relative Path</key>
	<string>Relative Path</string>
	<key>Remember Position</key>
	<string>Remember Position</string>
	<key>Remember Position: Disabled</key>
	<string>Remember Position: Disabled</string>
	<key>Remember Position: Enabled</key>
	<string>Remember Position: Enabled</string>
	<key>Remove</key>
	<string>Remove</string>
	<key>Remove All Tags</key>
	<string>Remove All Tags</string>
	<key>Remove Current Folder</key>
	<string>Remove Current Folder</string>
	<key>Rename</key>
	<string>Rename</string>
	<key>Render Original RAW</key>
	<string>Render Original RAW</string>
	<key>Replace</key>
	<string>Replace</string>
	<key>Reset</key>
	<string>Reset</string>
	<key>Reverse Filter</key>
	<string>Reverse Filter</string>
	<key>Rotate %d°</key>
	<string>Rotate %d°</string>
	<key>Rotate Clockwise</key>
	<string>Rotate Clockwise</string>
	<key>Rotate Counterclockwise</key>
	<string>Rotate Counterclockwise</string>
	<key>Save</key>
	<string>Save</string>
	<key>Scan &amp; Update Enhanced Index</key>
	<string>Scan &amp; Update Enhanced Index</string>
	<key>Scan Complete</key>
	<string>Scan Complete</string>
	<key>Scan Prompt</key>
	<string>Scan Prompt</string>
	<key>Scanning</key>
	<string>Scanning</string>
	<key>Scanning...</key>
	<string>Scanning...</string>
	<key>Search...</key>
	<string>Search...</string>
	<key>Sequential Playback</key>
	<string>Sequential Playback</string>
	<key>Sequential Playback: Disabled</key>
	<string>Sequential Playback: Disabled</string>
	<key>Sequential Playback: Enabled</key>
	<string>Sequential Playback: Enabled</string>
	<key>Set Auto Play Interval</key>
	<string>Set Auto Play Interval</string>
	<key>Set Scroll Speed</key>
	<string>Set Scroll Speed</string>
	<key>Settings...</key>
	<string>Settings...</string>
	<key>Share...</key>
	<string>Share...</string>
	<key>Show All</key>
	<string>Show All</string>
	<key>Show All Types of Files</key>
	<string>Show All Types of Files</string>
	<key>Show Camera RAW Files</key>
	<string>Show Camera RAW Files</string>
	<key>Show Exif</key>
	<string>Show Exif</string>
	<key>Show Filename</key>
	<string>Show Filename</string>
	<key>Show Finder Tags and Ratings</key>
	<string>Show Finder Tags and Ratings</string>
	<key>Show Hidden Files</key>
	<string>Show Hidden Files</string>
	<key>Show Image Files</key>
	<string>Show Image Files</string>
	<key>Show Info</key>
	<string>Show Info</string>
	<key>Show RAW/HDR Badge</key>
	<string>Show RAW/HDR Badge</string>
	<key>Show Shadow</key>
	<string>Show Shadow</string>
	<key>Show Statistics in Window Title</key>
	<string>Show Statistics in Window Title</string>
	<key>Show Tags and Ratings</key>
	<string>Show Tags and Ratings</string>
	<key>Show Video Files</key>
	<string>Show Video Files</string>
	<key>Show Video Metadata</key>
	<string>Show Video Metadata</string>
	<key>Show in Finder</key>
	<string>Show in Finder</string>
	<key>Show in Original Folder</key>
	<string>Show in Original Folder</string>
	<key>Sidebar</key>
	<string>Sidebar</string>
	<key>Skip</key>
	<string>Skip</string>
	<key>Sort</key>
	<string>Sort</string>
	<key>Sort Folders First</key>
	<string>Sort Folders First</string>
	<key>Sort Order</key>
	<string>Sort Order</string>
	<key>Sort Using Full Path In Collection Mode</key>
	<string>Sort Using Full Path In Collection Mode</string>
	<key>Sort by EXIF Info</key>
	<string>Sort by EXIF Info</string>
	<key>Statistic</key>
	<string>Statistic</string>
	<key>Stop</key>
	<string>Stop</string>
	<key>Success</key>
	<string>Success</string>
	<key>Symbolic Link</key>
	<string>Symbolic Link</string>
	<key>Tagging</key>
	<string>Tagging</string>
	<key>Text File</key>
	<string>Text File</string>
	<key>This app is now the default for all specified file types.</key>
	<string>This app is now the default for all specified file types.</string>
	<key>Thumbnail General</key>
	<string>Thumbnail General</string>
	<key>Thumbnail Options</key>
	<string>Thumbnail Options</string>
	<key>Thumbnail Size</key>
	<string>Thumbnail Size</string>
	<key>Undo</key>
	<string>Undo</string>
	<key>Unpin Window from Top</key>
	<string>Unpin Window from Top</string>
	<key>Unsupported Video Format</key>
	<string>Unsupported Video Format</string>
	<key>Updating Index</key>
	<string>Updating Index</string>
	<key>Use Full Path</key>
	<string>Use Full Path</string>
	<key>Use Full Path in Window Title</key>
	<string>Use Full Path in Window Title</string>
	<key>Use Internal Video Player</key>
	<string>Use Internal Video Player</string>
	<key>Video</key>
	<string>Video</string>
	<key>VideoMetadata-AvgFrameRate</key>
	<string>Avg Frame Rate</string>
	<key>VideoMetadata-BitRate</key>
	<string>Bit Rate</string>
	<key>VideoMetadata-CodecLongName</key>
	<string>Codec Long Name</string>
	<key>VideoMetadata-CodecName</key>
	<string>Codec Name</string>
	<key>VideoMetadata-ColorSpace</key>
	<string>Color Space</string>
	<key>VideoMetadata-CreationTime</key>
	<string>Creation Time</string>
	<key>VideoMetadata-Duration</key>
	<string>Duration</string>
	<key>VideoMetadata-EncoderSoftwareName</key>
	<string>Encoder Software Name</string>
	<key>VideoMetadata-FormatName</key>
	<string>Format Name</string>
	<key>VideoMetadata-Height</key>
	<string>Height</string>
	<key>VideoMetadata-Index</key>
	<string>Index</string>
	<key>VideoMetadata-Level</key>
	<string>Level</string>
	<key>VideoMetadata-PixelFormat</key>
	<string>Pixel Format</string>
	<key>VideoMetadata-Profile</key>
	<string>Profile</string>
	<key>VideoMetadata-RFrameRate</key>
	<string>Frame Rate</string>
	<key>VideoMetadata-Width</key>
	<string>Width</string>
	<key>Videos</key>
	<string>Videos</string>
	<key>View</key>
	<string>View</string>
	<key>Volume</key>
	<string>Volume</string>
	<key>Waterfall View</key>
	<string>Waterfall View</string>
	<key>Window Title</key>
	<string>Window Title</string>
	<key>Zoom</key>
	<string>Zoom</string>
	<key>Zoom In</key>
	<string>Zoom In</string>
	<key>Zoom Out</key>
	<string>Zoom Out</string>
	<key>ask-to-delete</key>
	<string>Are you sure you want to move these files to the trash?</string>
	<key>ask-to-delete-external</key>
	<string>This directory does not support moving to the trash. These items will be deleted immediately and this action cannot be undone.</string>
	<key>ask-to-delete-nopermission</key>
	<string>Are you sure you want to move these files to the trash?

The "Automation" permission has not been granted to this program. After moving to trash, the "Restore to Original Location" function cannot be used.</string>
	<key>ask-to-delete-shift</key>
	<string>Are you sure you want to permanently delete these files? This action cannot be undone.</string>
	<key>back-folder</key>
	<string>Back</string>
	<key>cannot-copy-to-self</key>
	<string>Cannot copy a file/folder to itself or its subdirectory.</string>
	<key>cannot-move-to-self</key>
	<string>Cannot move a file/folder to itself or its subdirectory.</string>
	<key>copy-lowercase</key>
	<string>copy</string>
	<key>copy-to-download</key>
	<string>Copy to "Downloads" Folder</string>
	<key>do-you-want-replace</key>
	<string>Do you want to replace it with the file you are pasting or moving?</string>
	<key>do-you-want-replace(move)</key>
	<string>Do you want to replace it with the file you are moving?</string>
	<key>do-you-want-replace(paste)</key>
	<string>Do you want to replace it with the file you are pasting?</string>
	<key>empty-enclose</key>
	<string>(Empty)</string>
	<key>file-exists-continue-batch-rename</key>
	<string>The files renamed in batch by sequence number conflict with existing files, for example, the new file names are a_1.jpg, a_2.jpg, a_3.jpg... but there is already a file named a_2.jpg. Should the sequence number automatically be incremented to continue?</string>
	<key>file-rightmenu-get-info</key>
	<string>Get Info</string>
	<key>file-rightmenu-get-statistic</key>
	<string>Get Statistic</string>
	<key>file-size</key>
	<string>Size</string>
	<key>first-time-use-prompt</key>
	<string>Double-click the left button to close.
Image: Hold the right or left button and scroll the wheel to zoom in or out.
Video: Hold down the right mouse button and drag to adjust playback progress.</string>
	<key>gen-thumb-info</key>
	<string> - "Prefer using embedded thumbnails" refers to prioritizing the use of thumbnails embedded within the image's EXIF data, which typically have lower resolution. However, since only the file header content needs to be read, it can significantly improve the speed of reading images on a network drive. As most images on the internet have their EXIF data removed to reduce file size, the program will then switch to "generate standard thumbnails."

 - "Generate standard thumbnails" refers to creating medium-quality thumbnails with a size of 512×512. In this case, the entire file content needs to be downloaded. (Since embedded thumbnails in RAW images usually have a higher resolution, their embedded thumbnails are still preferred in this mode.)

 - "Generate high-definition thumbnails" involves rendering the image precisely in the thumbnail area, and it is recommended to enable this option when the thumbnail size is larger than the default value. At this point, the re-rendered image may consume more memory.

Additionally, thumbnails are not generated for folders on external drives by default. Please go to "Settings" -&gt; "Advanced" to modify relevant options.</string>
	<key>has-exist-in-dest</key>
	<string>A file named "%@" already exists in the destination folder.</string>
	<key>has-same-name-files</key>
	<string>Has same name files</string>
	<key>has-same-name-files-info</key>
	<string>The source file contains files with the same name. Should they be automatically renamed?

For instance, multiple files named abc.jpg from different directories will be automatically renamed to abc.jpg, abc_2.jpg, abc_3.jpg...

Note: Please confirm the impact of this operation to prevent confusion.</string>
	<key>image-dimensions</key>
	<string>Dimensions</string>
	<key>input-new-folder-name</key>
	<string>Input new folder name: </string>
	<key>input-new-textfile-name</key>
	<string>Please enter the file name:</string>
	<key>move-to-download</key>
	<string>Move to "Downloads" Folder</string>
	<key>next-folder</key>
	<string>Next Folder</string>
	<key>next-sibling</key>
	<string>Next Sibling</string>
	<key>next-sibling-of-parent</key>
	<string>Next Sibling of Parent</string>
	<key>ocr-recog-fail</key>
	<string>The OCR function requires macOS 13.0 or later.</string>
	<key>open-in-new-tab-this</key>
	<string>Open This in New Tab</string>
	<key>operation-logs-info</key>
	<string>Records of file deletion, renaming, moving and pasting operations. There is currently no content.</string>
	<key>optimizeWindow</key>
	<string>Optimal Window Size</string>
	<key>pan-zoom</key>
	<string>Activate Pan Scrolling After Zoom</string>
	<key>pan-zoom-info</key>
	<string>The default behavior of the mouse wheel or touchpad scrolling is to switch images. When this feature is enabled, after the image is zoomed in, the scrolling behavior changes to panning. This is typically used for viewing long screenshots or comics.</string>
	<key>parent-folder</key>
	<string>Parent Folder</string>
	<key>portable-mode-info</key>
	<string>In Portable Mode:
 - When opening an image, the window automatically resizes to match the image's dimensions;
 - When closing an image, the window automatically resizes to a proportion of the screen.</string>
	<key>previous-folder</key>
	<string>Previous Folder</string>
	<key>previous-sibling</key>
	<string>Previous Sibling</string>
	<key>previous-sibling-of-parent</key>
	<string>Previous Sibling of Parent</string>
	<key>qrcode-recog-fail</key>
	<string>Failed to Recognize QR Code</string>
	<key>qrcode-recog-result</key>
	<string>QR Code Recognition Result</string>
	<key>rating-info</key>
	<string>**About XMP Ratings**
XMP ratings are a universal image scoring method that uses 1 to 5 stars to indicate image priority. They are industry-standard metadata, not a proprietary FlowVision format, and can be recognized by many XMP-compatible software applications.

**What is XMP?**
XMP (Extensible Metadata Platform) can be thought of as an “information card embedded within the image,” commonly used to store editable metadata such as ratings, keywords, and copyright information. Unlike EXIF, which primarily records camera settings like shutter speed, aperture, and ISO, XMP focuses more on descriptive, user-editable data. In terms of file structure, both reside in the image’s metadata area but belong to different data naming systems or data blocks and can coexist.

**Where Is the Rating Information Stored?**
FlowVision writes ratings into the xmp:Rating field within the image’s metadata. This information is typically embedded inside the image file’s metadata section—for example, in the metadata segment of JPEG files or in the corresponding metadata containers of PNG, TIFF, HEIF, and RAW formats—rather than being stored separately as a database record or as file system metadata.

**What Does “No Rating” Mean?**
When you select “No Rating,” FlowVision clears the xmp:Rating field (it does not write a value of 0). This indicates that the image currently has no rating assigned.

**Important Notes**
Setting or clearing a rating involves writing to the file. After writing, the file’s modification date will usually update, and the file size may also change slightly due to the metadata being rewritten. If you rely on modification time for synchronization, backups, or sorting, it’s advisable to understand this impact before performing batch ratings.</string>
	<key>raw-use-embeded-info</key>
	<string>When this option is enabled, use the embedded Exif thumbnail instead of rendering the original RAW.

RAW files typically come with high-quality Exif thumbnails for the camera's preview interface, which are non-original images corrected and processed by the camera's built-in program. By using these thumbnails, the program can significantly speed up loading times.</string>
	<key>recognize-OCR</key>
	<string>Recognize Text</string>
	<key>recognize-QRCode</key>
	<string>Recognize QR Code</string>
	<key>recursive-mode-info</key>
	<string>Once "Recursive Browsing Mode" is enabled, the thumbnail area will display all files within a folder and its subdirectories. When "Include Folders" is checked, all subfolders themselves will also be displayed.

Scanning certain system directories or network drives may cause the program to lag.

Additionally, in this mode, the application will not monitor file system changes, so if there are external modifications (such as edits or deletions), please refresh manually. For changes within the application, to ensure operational continuity, automatic refresh will not occur if there are too many images in the view; please refresh manually.</string>
	<key>recursive-mode-nodirection</key>
	<string>In recursive mode, the action to find the next/previous folder cannot be performed.</string>
	<key>renaming-conflict</key>
	<string>A file with this name already exists. Please choose a different name.</string>
	<key>save-to-custom-profile</key>
	<string>Save to Custom Profile %@</string>
	<key>scan-enhanced-index-info</key>
	<string>TODO</string>
	<key>scanned-files</key>
	<string>Currently scanned %d files, including %d images and %d videos. Do you want to continue?</string>
	<key>search-help</key>
	<string>**Filter Content**
The “Apply Filter” button filters the contents of the current directory, displaying only items that match the search criteria. To restore the original view, clear the search criteria and click this button again, or click the search icon in the toolbar.

**Search Subfolders**
To search files in subdirectories, first enable “Recursive Browse Mode”.

**What Are Regular Expressions?**
Regular expressions (regex) are patterns used to match character combinations within strings. They are a powerful text-processing tool widely used for tasks such as searching, replacing, and parsing text.
For example:
^2024 can match files starting with '2024';
.*modified\.[^.]+$ can match files ending with 'modified' (regardless of the extension);
.*\.jpg$ can match files with the '.jpg' extension.

**Advanced Search**
In “Recursive Browse Mode,” you can additionally use the “Use Full Path” option and combine it with regular expressions to perform advanced searches.
For example, given a full file path like:
/Users/Alice/Pictures/20220101/mypick/001.jpg
you can use the regular expression:
^.*\/[^\/]*pick[^\/]*\/[^\/]+$
to match all files whose parent directory names contain “pick.” For more complex regex patterns, you can use large language models to assist in writing them.</string>
	<key>sort-addDateA</key>
	<string>Sort by Date Added</string>
	<key>sort-addDateZ</key>
	<string>Sort by Date Added (Descending)</string>
	<key>sort-createDateA</key>
	<string>Sort by Date Created</string>
	<key>sort-createDateZ</key>
	<string>Sort by Date Created (Descending)</string>
	<key>sort-exif-local-warning</key>
	<string>Sorting by Exif information requires reading the headers of all files, which may result in slow loading speeds. For example, the reference reading speed for video file information is about 10 per second.

The current directory contains %d images or videos, with an estimated maximum loading time of %d seconds. Are you sure you want to continue?</string>
	<key>sort-exif-network-warning</key>
	<string>Sorting by Exif information requires reading the headers of all files, which may result in slow loading speeds. For example, the reference reading speed on an SMB network drive is about 10 per second.

The current directory is located on an external drive and contains %d images or videos, with an estimated maximum loading time of %d seconds. Are you sure you want to continue?</string>
	<key>sort-exifDateA</key>
	<string>Sort by Exif Date</string>
	<key>sort-exifDateZ</key>
	<string>Sort by Exif Date (Descending)</string>
	<key>sort-exifPixelA</key>
	<string>Sort by Exif Pixel Size</string>
	<key>sort-exifPixelZ</key>
	<string>Sort by Exif Pixel Size (Descending)</string>
	<key>sort-extA</key>
	<string>Sort by File Type</string>
	<key>sort-extZ</key>
	<string>Sort by File Type (Descending)</string>
	<key>sort-label-date</key>
	<string>Date</string>
	<key>sort-label-exifDate</key>
	<string>ExifDate</string>
	<key>sort-label-exifPixel</key>
	<string>ExifPixel</string>
	<key>sort-label-ext</key>
	<string>Type</string>
	<key>sort-label-name</key>
	<string>Name</string>
	<key>sort-label-random</key>
	<string>Random</string>
	<key>sort-label-size</key>
	<string>Size</string>
	<key>sort-modDateA</key>
	<string>Sort by Date Modified</string>
	<key>sort-modDateZ</key>
	<string>Sort by Date Modified (Descending)</string>
	<key>sort-pathA</key>
	<string>Sort by Filename</string>
	<key>sort-pathZ</key>
	<string>Sort by Filename (Descending)</string>
	<key>sort-random</key>
	<string>Sort Randomly</string>
	<key>sort-readme</key>
	<string>“Sorting by full path in collection mode” means that, in recursive mode or when working with tag collections, if two files have the following paths relative to the current directory:
./AAA/2.jpg
./BBB/1.jpg
then 2.jpg will come first when sorted by full path, whereas 1.jpg will come first when sorted by filename.

When sorting by Exif information, the header of each file must be read, which may result in slower loading speeds. For example, on an SMB network drive or with video files, the typical read rate is about 10 files per second.</string>
	<key>sort-sizeA</key>
	<string>Sort by File Size</string>
	<key>sort-sizeZ</key>
	<string>Sort by File Size (Descending)</string>
	<key>statistic-content</key>
	<string>Folder Count: %d
File Count: %d
Image Count: %d
Video Count: %d
Total Size: %@</string>
	<key>switch-to-custom-profile</key>
	<string>Switch to Custom Profile %@</string>
	<key>switchToActualSize</key>
	<string>Image Default Actual Size</string>
	<key>switchToDarkMode</key>
	<string>Dark Mode</string>
	<key>switchToFitToWindow</key>
	<string>Image Default Fit to Window</string>
	<key>switchToLightMode</key>
	<string>Light Mode</string>
	<key>switchToSystemTheme</key>
	<string>Match System</string>
	<key>up-folder</key>
	<string>Enclosing Folder</string>
	<key>video-dimensions</key>
	<string>Dimensions</string>
	<key>video-play-info</key>
	<string>In the player interface, pressing the left mouse button pauses playback, and right-click dragging adjusts the video playback progress. The keyboard left and right arrow keys can fast forward and rewind, and holding the Cmd key allows for frame-by-frame navigation.

macOS natively supports video formats such as "mp4", "mov", "m2ts", "ts", "mpeg", "mpg", "m4v", and "vob". Other formats still require an external player for playback.

For HEVC-encoded videos, macOS’s built-in decoder only recognizes codec tags of hvc1 and does not recognize tags of hev1. You can use FFmpeg to perform a lossless conversion: ffmpeg -i input.mp4 -c copy -movflags +faststart -tag:v hvc1 output.mp4.

Press Cmd+Shift+V to "Auto Play Visible Videos," meaning in thumbnail view, it will loop videos within the visible area. Pressing the shortcut again or switching folders will exit this mode.</string>
	<key>window-num-max</key>
	<string>The number of windows exceeds the limit.</string>
</dict>
</plist>
